Revit 2018 API
OverrideGraphicSettings.CutFillPatternId Property
 ElementId of the cut surface fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2014
Syntax
C#
public ElementId CutFillPatternId { get; }
Visual Basic
Public ReadOnly Property CutFillPatternId As ElementId
	Get
Visual C++
public:
property ElementId^ CutFillPatternId {
	ElementId^ get ();
}
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace